/*
Задача 28:
Напишите программу, которая принимает на вход число N
и выдаёт произведение чисел от 1 до N.
4 -> 24
5 -> 120
*/

System.Console.Write("Введите число:\t");
int number = Convert.ToInt32(Console.ReadLine());

